MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L373PS/mcu.h
typedef struct {
    __IO uint32_t IMR;
    __IO uint32_t EMR;
    __IO uint32_t RTSR;
    __IO uint32_t FTSR;
    __IO uint32_t SWIER;
    __IO uint32_t PR;
} EXTI_TypeDef;

/**
* @brief FLASH Registers
*/

typedef struct {
    __IO uint32_t ACR;
    __IO uint32_t KEYR;
    __IO uint32_t OPTKEYR;
    __IO uint32_t SR;
    __IO uint32_t CR;
    __IO uint32_t AR;
    __IO uint32_t RESERVED;
    __IO uint32_t OBR;
    __IO uint32_t WRPR;
} FLASH_TypeDef;

/**
* @brief Option Bytes Registers
*/

typedef struct {
    __IO uint16_t RDP;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRP0;
    __IO uint16_t WRP1;
    __IO uint16_t WRP2;
    __IO uint16_t WRP3;
} OB_TypeDef;



/**
* @brief General Purpose IO
*/

typedef struct {
    __IO uint32_t CRL;
    __IO uint32_t CRH;
    __IO uint32_t IDR;
    __IO uint32_t ODR;
    __IO uint32_t BSRR;
    __IO uint32_t BRR;
    __IO uint32_t LCKR;
} GPIO_TypeDef;

/**
* @brief Alternate Function IO
*/

typedef struct {
    __IO uint32_t EVCR;
    __IO uint32_t MAPR;
    __IO uint32_t EXTICR[4];
} AFIO_TypeDef;
/**
* @brief Inter-integrated Circuit Interface
*/

typedef struct {
    __IO uint16_t IC_CON;
    uint16_t  RESERVED0;
    __IO uint16_t IC_TAR;
    uint16_t  RESERVED1;
    __IO uint16_t IC_SAR;
    uint16_t  RESERVED2;
    __IO uint16_t IC_HS_MADDR;
    uint16_t  RESERVED3;
    __IO uint16_t IC_DATA_CMD;
    uint16_t  RESERVED4;
    __IO uint16_t IC_SS_SCL_HCNT;
    uint16_t  RESERVED5;
    __IO uint16_t IC_SS_SCL_LCNT;
    uint16_t  RESERVED6;
    __IO uint16_t IC_FS_SCL_HCNT;
    uint16_t  RESERVED7;
    __IO uint16_t IC_FS_SCL_LCNT;
    uint16_t  RESERVED8;
    __IO uint16_t IC_HS_SCL_HCNT;
    uint16_t  RESERVED9;
    __IO uint16_t IC_HS_SCL_LCNT;
    uint16_t  RESERVED10;
    __IO uint16_t IC_INTR_STAT;
    uint16_t  RESERVED11;
    __IO uint16_t IC_INTR_MASK;
    uint16_t  RESERVED12;
    __IO uint16_t IC_RAW_INTR_STAT;
    uint16_t  RESERVED13;
    __IO uint16_t IC_RX_TL;
    uint16_t  RESERVED14;
    __IO uint16_t IC_TX_TL;
    uint16_t  RESERVED15;
    __IO uint16_t IC_CLR_INTR;
    uint16_t  RESERVED16;
    __IO uint16_t IC_CLR_RX_UNDER;
    uint16_t  RESERVED17;
    __IO uint16_t IC_CLR_RX_OVER;
    uint16_t  RESERVED18;
    __IO uint16_t IC_CLR_TX_OVER;
    uint16_t  RESERVED19;
    __IO uint16_t IC_CLR_RD_REQ;
    uint16_t  RESERVED20;
    __IO uint16_t IC_CLR_TX_ABRT;
    uint16_t  RESERVED21;
    __IO uint16_t IC_CLR_RX_DONE;
    uint16_t  RESERVED22;
    __IO uint16_t IC_CLR_ACTIVITY;
    uint16_t  RESERVED23;
    __IO uint16_t IC_CLR_STOP_DET;
    uint16_t  RESERVED24;
    __IO uint16_t IC_CLR_START_DET;
    uint16_t  RESERVED25;
    __IO uint16_t IC_CLR_GEN_CALL;
    uint16_t  RESERVED26;
    __IO uint16_t IC_ENABLE;               //RESERVED
    uint16_t  RESERVED27;

    __IO uint32_t IC_STATUS;
    __IO uint32_t IC_TXFLR;                //RESERVED
    __IO uint32_t IC_RXFLR;                //RESERVED
    __IO uint32_t IC_SDA_HOLD;             //RESERVED
    __IO uint32_t IC_TX_ABRT_SOURCE;       //RESERVED
    __IO uint32_t IC_SLV_DATA_NACK_ONLY;   //RESERVED
    __IO uint32_t IC_DMA_CR;               //RESERVED
    __IO uint32_t IC_DMA_TDLR;             //RESERVED
    __IO uint32_t IC_DMA_RDLR;             //RESERVED
    __IO uint32_t IC_SDA_SETUP;            //RESERVED
    __IO uint32_t IC_ACK_GENERAL_CALL;     //RESERVED

    __IO uint32_t IC_FS_SPKLEN;
    __IO uint32_t IC_HS_SPKLEN;

    __IO uint16_t IC_CLR_RESTART_DET;
    uint16_t  RESERVED28;
    __IO uint32_t IC_COMP_PARAM_1;
    __IO uint32_t IC_COMP_VERSION;
    __IO uint32_t IC_COMP_TYPE;

} I2C_TypeDef;

/**
* @brief Independent WATCHDOG
*/

typedef struct {
    __IO uint32_t KR;
    __IO uint32_t PR;
    __IO uint32_t RLR;
    __IO uint32_t SR;
} IWDG_TypeDef;

/**
* @brief Power Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSR;
} PWR_TypeDef;

/**
* @brief Reset and Clock Control
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFGR;
    __IO uint32_t CIR;
    __IO uint32_t APB2RSTR;
    __IO uint32_t APB1RSTR;
    __IO uint32_t AHBENR;
    __IO uint32_t APB2ENR;
    __IO uint32_t APB1ENR;
    __IO uint32_t BDCR;
    __IO uint32_t CSR;
} RCC_TypeDef;

/**
* @brief Real-Time Clock
*/

typedef struct {
    __IO uint16_t CRH;
    uint16_t  RESERVED0;
    __IO uint16_t CRL;
    uint16_t  RESERVED1;
    __IO uint16_t PRLH;
    uint16_t  RESERVED2;
    __IO uint16_t PRLL;
    uint16_t  RESERVED3;
    __IO uint16_t DIVH;
    uint16_t  RESERVED4;
    __IO uint16_t DIVL;
    uint16_t  RESERVED5;
    __IO uint16_t CNTH;
    uint16_t  RESERVED6;
    __IO uint16_t CNTL;
    uint16_t  RESERVED7;
    __IO uint16_t ALRH;
    uint16_t  RESERVED8;
    __IO uint16_t ALRL;
    uint16_t  RESERVED9;
} RTC_TypeDef;


/**
* @brief Serial Peripheral Interface
*/


typedef struct {
    __IO uint32_t TXREG;
    __IO uint32_t RXREG;
    __IO uint16_t CSTAT;
    uint16_t  RESERVED0;
    __IO uint16_t INTSTAT;
    uint16_t  RESERVED1;
    __IO uint16_t INTEN;
    uint16_t  RESERVED2;
    __IO uint16_t INTCLR;
    uint16_t  RESERVED3;
    __IO uint16_t GCTL;
    uint16_t  RESERVED4;
    __IO uint16_t CCTL;
    uint16_t  RESERVED5;
    __IO uint16_t SPBRG;
    uint16_t  RESERVED6;
    __IO uint16_t RXDNR;
    uint16_t  RESERVED7;
    __IO uint16_t SCSR;
    uint16_t  RESERVED8;
    __IO uint16_t EXTSCR;
    uint16_t  RESERVED9;
} SPI_TypeDef;




/**
* @brief TIM
*/

typedef struct {
    __IO uint16_t CR1;
    uint16_t  RESERVED0;
    __IO uint16_t CR2;
    uint16_t  RESERVED1;
    __IO uint16_t SMCR;
    uint16_t  RESERVED2;
    __IO uint16_t DIER;
    uint16_t  RESERVED3;
    __IO uint16_t SR;
    uint16_t  RESERVED4;
    __IO uint16_t EGR;
    uint16_t  RESERVED5;
    __IO uint16_t CCMR1;
    uint16_t  RESERVED6;
    __IO uint16_t CCMR2;
    uint16_t  RESERVED7;
    __IO uint16_t CCER;
    uint16_t  RESERVED8;
    __IO uint16_t CNT;
    uint16_t  RESERVED9;
    __IO uint16_t PSC;
    uint16_t  RESERVED10;
    __IO uint16_t ARR;
    uint16_t  RESERVED11;
    __IO uint16_t RCR;
    uint16_t  RESERVED12;
    __IO uint16_t CCR1;
    uint16_t  RESERVED13;
    __IO uint16_t CCR2;
    uint16_t  RESERVED14;
    __IO uint16_t CCR3;
    uint16_t  RESERVED15;
    __IO uint16_t CCR4;
    uint16_t  RESERVED16;
    __IO uint16_t BDTR;
    uint16_t  RESERVED17;
    __IO uint16_t DCR;
    uint16_t  RESERVED18;
    __IO uint16_t DMAR;
    uint16_t  RESERVED19;
} TIM_TypeDef;

/**
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/

