MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L373PS/mcu.h
typedef struct {
    __IO uint32_t TDR;
    __IO uint32_t RDR;
    __IO uint32_t CSR;
    __IO uint32_t ISR;
    __IO uint32_t IER;
    __IO uint32_t ICR;
    __IO uint32_t GCR;
    __IO uint32_t CCR;
    __IO uint32_t BRR;
    __IO uint32_t FRA;

} UART_TypeDef;

/**
* @brief Window WATCHDOG
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CFR;
    __IO uint32_t SR;
} WWDG_TypeDef;


/**
* @brief USB
*/
typedef struct {
    __IO uint32_t  rTOP;              /*!           Address offset: 0x00 */
    __IO uint32_t  rINT_STATE;            /*!           Address offset: 0x04 */
    __IO uint32_t  rEP_INT_STATE;         /*!           Address offset: 0x08 */
    __IO uint32_t  rEP0_INT_STATE;        /*!           Address offset: 0x0C */
    __IO uint32_t  rINT_EN;               /*!           Address offset: 0x10 */
    __IO uint32_t  rEP_INT_EN;            /*!           Address offset: 0x14 */
    __IO uint32_t  rEP0_INT_EN;       /*!           Address offset: 0x18 */

    __IO uint32_t  RESERVED0;

    //__IO uint32_t  rEP1_4_INT_STATE[4];      /*!           Address offset: 0x20 */

    __IO uint32_t  rEP1_INT_STATE;      /*!           Address offset: 0x20 */
    __IO uint32_t  rEP2_INT_STATE;      /*!           Address offset: 0x24 */
    __IO uint32_t  rEP3_INT_STATE;      /*!           Address offset: 0x28 */
    __IO uint32_t  rEP4_INT_STATE;      /*!           Address offset: 0x2C */

    __IO uint32_t  RESERVED1;             /*!           Address offset: 0x30 */
    __IO uint32_t  RESERVED2;             /*!           Address offset: 0x34 */
    __IO uint32_t  RESERVED3;             /*!           Address offset: 0x38 */
    __IO uint32_t  RESERVED4;             /*!           Address offset: 0x3C */

    __IO uint32_t  rEP1_INT_EN;           /*!           Address offset: 0x40 */
    __IO uint32_t  rEP2_INT_EN;           /*!           Address offset: 0x44 */
    __IO uint32_t  rEP3_INT_EN;           /*!           Address offset: 0x48 */
    __IO uint32_t  rEP4_INT_EN;           /*!           Address offset: 0x4C */

    __IO uint32_t  RESERVED5;             /*!           Address offset: 0x50 */
    __IO uint32_t  RESERVED6;             /*!           Address offset: 0x54 */
    __IO uint32_t  RESERVED7;             /*!           Address offset: 0x58 */
    __IO uint32_t  RESERVED8;             /*!           Address offset: 0x5C */

    __IO uint32_t  rADDR;             /*!           Address offset: 0x60 */
    __IO uint32_t  rEP_EN;                /*!           Address offset: 0x64 */

    __IO uint32_t  RESERVED9;             /*!           Address offset: 0x68 */
    __IO uint32_t  RESERVED10;            /*!           Address offset: 0x6C */
    __IO uint32_t  RESERVED11;            /*!           Address offset: 0x70 */
    __IO uint32_t  RESERVED12;            /*!           Address offset: 0x74 */

    __IO uint32_t  rTOG_CTRL1_4;        /*!           Address offset: 0x78 */

    __IO uint32_t  RESERVED13;            /*!           Address offset: 0x7C */

    __IO uint32_t  rSETUP[8];             /*!           Address offset: 0x80 */
    //__IO uint32_t  rSETUP0;             /*!           Address offset: 0x80 */
    //__IO uint32_t  rSETUP1;             /*!           Address offset: 0x84 */
    //__IO uint32_t  rSETUP2;             /*!           Address offset: 0x88 */
    //__IO uint32_t  rSETUP3;             /*!           Address offset: 0x8C */
    //__IO uint32_t  rSETUP4;             /*!           Address offset: 0x90 */
    //__IO uint32_t  rSETUP5;             /*!           Address offset: 0x94 */
    //__IO uint32_t  rSETUP6;             /*!           Address offset: 0x98 */
    //__IO uint32_t  rSETUP7;             /*!           Address offset: 0x9C */
    __IO uint32_t  rPAKET_SIZE0;      /*!           Address offset: 0xA0 */
    __IO uint32_t  rPAKET_SIZE1;      /*!           Address offset: 0xA4 */

    __IO uint32_t  RESERVED14;            /*!           Address offset: 0xA8 */
    __IO uint32_t  RESERVED15;            /*!           Address offset: 0xAC */

    __IO uint32_t  RESERVED16;            /*!           Address offset: 0xB0 */
    __IO uint32_t  RESERVED17;            /*!           Address offset: 0xB4 */
    __IO uint32_t  RESERVED18;            /*!           Address offset: 0xB8 */
    __IO uint32_t  RESERVED19;            /*!           Address offset: 0xBC */

    __IO uint32_t  RESERVED20;            /*!           Address offset: 0xC0 */
    __IO uint32_t  RESERVED21;            /*!           Address offset: 0xC4 */
    __IO uint32_t  RESERVED22;            /*!           Address offset: 0xC8 */
    __IO uint32_t  RESERVED23;            /*!           Address offset: 0xCC */

    __IO uint32_t  RESERVED24;            /*!           Address offset: 0xD0 */
    __IO uint32_t  RESERVED25;            /*!           Address offset: 0xD4 */
    __IO uint32_t  RESERVED26;            /*!           Address offset: 0xD8 */
    __IO uint32_t  RESERVED27;            /*!           Address offset: 0xDC */

    __IO uint32_t  RESERVED28;            /*!           Address offset: 0xE0 */
    __IO uint32_t  RESERVED29;            /*!           Address offset: 0xE4 */
    __IO uint32_t  RESERVED30;            /*!           Address offset: 0xE8 */
    __IO uint32_t  RESERVED31;            /*!           Address offset: 0xEC */

    __IO uint32_t  RESERVED32;            /*!           Address offset: 0xF0 */
    __IO uint32_t  RESERVED33;            /*!           Address offset: 0xF4 */
    __IO uint32_t  RESERVED34;            /*!           Address offset: 0xF8 */
    __IO uint32_t  RESERVED35;            /*!           Address offset: 0xFC */

    __IO uint32_t  rEP0_AVIL;         /*!           Address offset: 0x100 */
    __IO uint32_t  rEP1_AVIL;         /*!           Address offset: 0x104 */
    __IO uint32_t  rEP2_AVIL;         /*!           Address offset: 0x108 */
    __IO uint32_t  rEP3_AVIL;         /*!           Address offset: 0x10C */
    __IO uint32_t  rEP4_AVIL;         /*!           Address offset: 0x110 */

    __IO uint32_t  RESERVED36;            /*!           Address offset: 0x114 */
    __IO uint32_t  RESERVED37;            /*!           Address offset: 0x118 */
    __IO uint32_t  RESERVED38;            /*!           Address offset: 0x11C */
    __IO uint32_t  RESERVED39;            /*!           Address offset: 0x120 */

    __IO uint32_t  RESERVED40;            /*!           Address offset: 0x124 */
    __IO uint32_t  RESERVED41;            /*!           Address offset: 0x128 */
    __IO uint32_t  RESERVED42;            /*!           Address offset: 0x12C */
    __IO uint32_t  RESERVED43;            /*!           Address offset: 0x130 */

    __IO uint32_t  RESERVED44;            /*!           Address offset: 0x134 */
    __IO uint32_t  RESERVED45;            /*!           Address offset: 0x138 */
    __IO uint32_t  RESERVED46;            /*!           Address offset: 0x13C */

    __IO uint32_t  rEP0_CTRL;         /*!           Address offset: 0x140 */
    __IO uint32_t  rEP1_CTRL;         /*!           Address offset: 0x144 */
    __IO uint32_t  rEP2_CTRL;         /*!           Address offset: 0x148 */
    __IO uint32_t  rEP3_CTRL;         /*!           Address offset: 0x14C */
    __IO uint32_t  rEP4_CTRL;         /*!           Address offset: 0x150 */

